Repository: yeager/swedish-tm
Catalog: sv-weblate.tmx
Source language: en
Languages: sv

source: When choosing a file format for your application, it's better to stick some well established format in the toolkit/platform you use. This way your translators can additionally use whatever tools they are used to, and will more likely contribute to your project.
sv: NÃ¤r du vÃ¤ljer ett filformat fÃ¶r din applikation Ã¤r det bÃ¤ttre att hÃ¥lla sig till ett vÃ¤l etablerat format i det verktyg/den plattform du anvÃ¤nder. PÃ¥ sÃ¥ sÃ¤tt kan dina Ã¶versÃ¤ttare dessutom anvÃ¤nda de verktyg de Ã¤r vana vid, vilket Ã¶kar sannolikheten att de bidrar till ditt projekt.

source: Automatic detection
sv: Automatisk igenkänning

source: Weblate tries to detect file format during :ref:`adding-projects`. The detection might be wrong for different variants of the same serialization format (JSON, YAML, properties) or file encoding, so please verify that :ref:`component-file_format` is correct before creating the component.
sv: Weblate fÃ¶rsÃ¶ker upptÃ¤cka filformatet under :ref:`adding-projects`. Detekteringen kan vara felaktig fÃ¶r olika varianter av samma serialiseringsformat (JSON, YAML, egenskaper) eller filkodning, sÃ¥ kontrollera att :ref:`component-file_format` Ã¤r korrekt innan du skapar komponenten.

source: Translation types capabilities
sv: ÃversÃ¤ttningstyper och funktioner

source: Capabilities of all supported formats
sv: Funktioner fÃ¶r alla format som stÃ¶ds

source: Linguality [#m]_
sv: Lingualitet [#m]_

source: Plurals [#p]_
sv: Pluralformer [#p]_

source: Descriptions [#n]_
sv: Beskrivningar [#n]_

source: Context [#c]_
sv: Kontext [#c]_

source: Location [#l]_
sv: Plats [#l]_

source: Flags [#f]_
sv: Flaggor [#f]_

source: Additional states [#a]_
sv: Ytterligare stater [#a]_

source: bilingual
sv: tvÃ¥sprÃ¥kig

source: yes [#po]_
sv: ja [#po]_

source: needs editing
sv: behÃ¶ver redigeras

source: both
sv: bÃ¥da

source: needs editing, approved
sv: behÃ¶ver redigeras, godkÃ¤nd

source: yes [#x]_
sv: ja [#x]_

source: no [#lp]_
sv: nej [#lp]_

source: no [#fp]_
sv: nej [#fp]_

source: See :ref:`bimono`
sv: Se :ref:`bimono`

source: See :ref:`format-plurals`
sv: Se :ref:`format-plurals`

source: See :ref:`format-description`
sv: Se :ref:`format-description`

source: See :ref:`format-context`
sv: Se :ref:`format-context`

source: See :ref:`format-location`
sv: Se :ref:`format-location`

source: See :ref:`format-states`
sv: Se :ref:`format-states`

source: XML comment placed before the ``<string>`` element, parsed as a source string description.
sv: XML-kommentar placerad fÃ¶re elementet ``<string>``, tolkad som en kÃ¤llstrÃ¤ngsbeskrivning.

source: See :ref:`format-flags`.
sv: Se :ref:`format-flags`.

source: The gettext type comments are used as flags.
sv: Kommentarer av typen gettext anvÃ¤nds som flaggor.

source: The plurals are supported only for Laravel which uses in string syntax to define them, see `Localization in Laravel`_.
sv: Pluralformer stÃ¶ds endast fÃ¶r Laravel, som anvÃ¤nder strÃ¤ngsyntax fÃ¶r att definiera dem, se `Lokalisering i Laravel`_.

source: Plurals are handled in the syntax of the strings and not exposed as plurals in Weblate.
sv: Pluralformer hanteras i strÃ¤ngarnas syntax och visas inte som pluralformer i Weblate.

source: Bilingual and monolingual formats
sv: TvÃ¥sprÃ¥kiga och ensprÃ¥kiga format

source: Both :index:`monolingual <pair: translation; monolingual>` and :index:`bilingual <pair: translation; bilingual>` formats are supported. Bilingual formats store two languages in single fileâsource and translation (typical examples are :ref:`gettext`, :ref:`xliff` or :ref:`apple`). On the other side, monolingual formats identify the string by ID, and each language file contains only the mapping of those to any given language (typically :ref:`aresource`). Some file formats are used in both variants, see the detailed description below.
sv: BÃ¥de :index:`monolingual <pair: translation; monolingual>` och :index:`bilingual <pair: translation; bilingual>` format stÃ¶ds. TvÃ¥sprÃ¥kiga format lagrar tvÃ¥ sprÃ¥k i en enda fil â kÃ¤llsprÃ¥k och Ã¶versÃ¤ttning (typiska exempel Ã¤r :ref:`gettext`, :ref:`xliff` eller :ref:`apple`). Ã andra sidan identifierar ensprÃ¥kiga format strÃ¤ngen med hjÃ¤lp av ID, och varje sprÃ¥kfil innehÃ¥ller endast mappningen av dessa till ett visst sprÃ¥k (vanligtvis :ref:`aresource`). Vissa filformat anvÃ¤nds i bÃ¥da varianterna, se den detaljerade beskrivningen nedan.

source: For correct use of monolingual files, Weblate requires access to a file containing complete list of strings to translate with their sourceâthis file is called :ref:`component-template` within Weblate, though the naming might vary in your paradigm.
sv: FÃ¶r korrekt anvÃ¤ndning av ensprÃ¥kiga filer krÃ¤ver Weblate Ã¥tkomst till en fil som innehÃ¥ller en komplett lista Ã¶ver strÃ¤ngar som ska Ã¶versÃ¤ttas med deras kÃ¤lla. Denna fil kallas :ref:`component-template` inom Weblate, men namnet kan variera beroende pÃ¥ ditt paradigm.

source: Additionally this workflow can be extended by utilizing :ref:`component-intermediate` to include strings provided by developers, but not to be used as is in the final strings.
sv: Dessutom kan detta arbetsflÃ¶de utÃ¶kas genom att anvÃ¤nda :ref:`component-intermediate` fÃ¶r att inkludera strÃ¤ngar som tillhandahÃ¥lls av utvecklare, men som inte ska anvÃ¤ndas som de Ã¤r i de slutliga strÃ¤ngarna.

source: String states
sv: StrÃ¤ngtillstÃ¥nd

source: Many file formats only differentiate "Untranslated" and "Translated" strings. With some formats it is possible to store more fine-grained state information, such as "Needs editing" or "Approved".
sv: MÃ¥nga filformat skiljer endast mellan "OÃ¶versatta" och "Ãversatta" strÃ¤ngar. Med vissa format Ã¤r det mÃ¶jligt att lagra mer detaljerad statusinformation, sÃ¥som "BehÃ¶ver redigeras" eller "GodkÃ¤nt".

source: Source string descriptions can be used to pass additional info about the string to translate.
sv: KÃ¤llstrÃ¤ngbeskrivningar kan anvÃ¤ndas fÃ¶r att vidarebefordra ytterligare information om strÃ¤ngen som ska Ã¶versÃ¤ttas.

source: Several formats have native support for providing additional info to translators (for example :ref:`xliff`, :ref:`gettext`, :ref:`webex`, :ref:`csv`, :ref:`xlsx`, :ref:`qtling`, :ref:`go-i18n-json`, :ref:`gotext-json`, :ref:`arb`, :ref:`dotnet`). Many other formats extract closest comment as source string description.
sv: Flera format har inbyggt stÃ¶d fÃ¶r att tillhandahÃ¥lla ytterligare information till Ã¶versÃ¤ttare (till exempel :ref:`xliff`, :ref:`gettext`, :ref:`webex`, :ref:`csv`, :ref:`xlsx`, :ref:`qtling`, :ref:`go-i18n-json`, :ref:`gotext-json`, :ref:`arb`, :ref:`dotnet`). MÃ¥nga andra format extraherar nÃ¤rmaste kommentar som kÃ¤llstrÃ¤ngbeskrivning.

source: The :ref:`additional-explanation` on strings can be stored and parsed from a few file formats.
sv: Den :ref:`additional-explanation` om strÃ¤ngar kan lagras och analyseras frÃ¥n nÃ¥gra filformat.

source: Currently supported only in :ref:`tbx`.
sv: StÃ¶ds fÃ¶r nÃ¤rvarande endast i :ref:`tbx`.

source: Location of a string in source code might help proficient translators figure out how the string is used.
sv: Placeringen av en strÃ¤ng i kÃ¤llkoden kan hjÃ¤lpa skickliga Ã¶versÃ¤ttare att fÃ¶rstÃ¥ hur strÃ¤ngen anvÃ¤nds.

source: This information is typically available in bilingual formats where strings are extracted from the source code using tools. For example :ref:`gettext` and :ref:`qtling`.
sv: Denna information finns vanligtvis tillgÃ¤nglig i tvÃ¥sprÃ¥kiga format dÃ¤r strÃ¤ngar extraheras frÃ¥n kÃ¤llkoden med hjÃ¤lp av verktyg. Till exempel :ref:`gettext` och :ref:`qtling`.

source: Translation flags allow customizing Weblate behavior. Some formats support defining those in the translation file (you can always define them in the Weblate interface, see :ref:`custom-checks`).
sv: ÃversÃ¤ttningsflaggor gÃ¶r det mÃ¶jligt att anpassa Weblates beteende. Vissa format stÃ¶der definition av dessa i Ã¶versÃ¤ttningsfilen (du kan alltid definiera dem i Weblate-grÃ¤nssnittet, se :ref:`custom-checks`).

source: This feature is modelled on flags in :ref:`gettext`.
sv: Denna funktion Ã¤r utformad efter flaggorna i :ref:`gettext`.

source: Additionally, for all XML based format, the flags are extracted from the non-standard attribute ``weblate-flags``. Additionally ``max-length:N`` is supported through the ``maxwidth`` `attribute <https://docs.oasis-open.org/xliff/v1.2/os/xliff-core.html#maxwidth>`_ as defined in the XLIFF standard, see :ref:`xliff-flags`.
sv: Dessutom extraheras flaggorna fÃ¶r alla XML-baserade format frÃ¥n det icke-standardiserade attributet ``weblate-flags``. Dessutom stÃ¶ds ``max-length:N`` genom attributet ``maxwidth`` `attribute <https://docs.oasis-open.org/xliff/v1.2/os/xliff-core.html#maxwidth>`_ enligt definitionen i XLIFF-standarden, se :ref:`xliff-flags`.

source: `PO files documentation`_
sv: `PO-filer dokumentation`_

source: Context is used to differentiate identical strings in a bilingual format used in different scopes (for example `Sun` can be used as an abbreviated name of the day "Sunday" or as the name of our closest star).
sv: Kontext anvÃ¤nds fÃ¶r att skilja identiska strÃ¤ngar i ett tvÃ¥sprÃ¥kigt format som anvÃ¤nds i olika sammanhang (till exempel kan `Sun` anvÃ¤ndas som en fÃ¶rkortning av dagen "Sunday" eller som namnet pÃ¥ vÃ¥r nÃ¤rmaste stjÃ¤rna).

source: For monolingual formats the string identifier (often called key) can serve the same purpose and additional context is not necessary.
sv: FÃ¶r ensprÃ¥kiga format kan strÃ¤ngidentifieraren (ofta kallad nyckel) tjÃ¤na samma syfte och ytterligare kontext Ã¤r inte nÃ¶dvÃ¤ndig.

source: Pluralized strings
sv: Pluraliserade strÃ¤ngar

source: Plurals are necessary to properly localize strings with variable count. The rules depend on a target language and many formats follow CLDR specification for that.
sv: Pluralformer Ã¤r nÃ¶dvÃ¤ndiga fÃ¶r att korrekt lokalisera strÃ¤ngar med varierande antal. Reglerna beror pÃ¥ mÃ¥lsprÃ¥ket och mÃ¥nga format fÃ¶ljer CLDR-specifikationen fÃ¶r detta.

source: Pluralizing strings need proper support from the application framework as well. Choose native format of your platform such as :ref:`gettext`, :ref:`aresource` or :ref:`stringsdict`.
sv: Pluralisering av strÃ¤ngar krÃ¤ver ocksÃ¥ korrekt stÃ¶d frÃ¥n applikationsramverket. VÃ¤lj plattformens inbyggda format, till exempel :ref:`gettext`, :ref:`aresource` eller :ref:`stringsdict`.

source: Read-only strings from translation files will be included, but can not be edited in Weblate. This feature is natively supported by few formats (:ref:`xliff` and :ref:`aresource`), but can be emulated in others by adding a ``read-only`` flag, see :ref:`custom-checks`.
sv: Skrivskyddade strÃ¤ngar frÃ¥n Ã¶versÃ¤ttningsfiler kommer att inkluderas, men kan inte redigeras i Weblate. Denna funktion stÃ¶ds inbyggt av fÃ¥ format (:ref:`xliff` och :ref:`aresource`), men kan emuleras i andra genom att lÃ¤gga till en ``skrivskyddad`` flagga, se :ref:`custom-checks`.

source: Supporting other formats
sv: StÃ¶d fÃ¶r andra format

source: Most formats supported by `translate-toolkit`_ which support serializing can be easily supported, but they did not (yet) received any testing. In most cases, an additional thin layer is needed in Weblate to hide differences in behavior of different storages.
sv: De flesta format som stÃ¶ds av `translate-toolkit`_ och som stÃ¶der serialisering kan enkelt stÃ¶djas, men de har (Ã¤nnu) inte testats. I de flesta fall behÃ¶vs ett extra tunt lager i Weblate fÃ¶r att dÃ¶lja skillnader i beteendet hos olika lagringsplatser.

source: To add support for a new format, the preferred approach is to first implement support for it in the `translate-toolkit`_.
sv: FÃ¶r att lÃ¤gga till stÃ¶d fÃ¶r ett nytt format Ã¤r det bÃ¤sta sÃ¤ttet att fÃ¶rst implementera stÃ¶d fÃ¶r det i `translate-toolkit`_.

source: File format parameters provide a way to configure settings related to the file format. They are configured at component level and allow you to customize how file parsing and serialization are handled.
sv: Filformatparametrarna gÃ¶r det mÃ¶jligt att konfigurera instÃ¤llningar relaterade till filformatet. De konfigureras pÃ¥ komponentnivÃ¥ och gÃ¶r det mÃ¶jligt att anpassa hur filanalys och serialisering hanteras.

source: List of file format parameters
sv: Lista Ã¶ver filformatsparametrar

source: Parameter name
sv: Parameternamn

source: File formats
sv: Filformat

source: Help text
sv: HjÃ¤lptext

source: flatxml_value_name
sv: flatxml_vÃ¤rdenamn

source: po_keep_previous
sv: po_behÃ¥ll_fÃ¶regÃ¥ende

source: By default, gettext wraps lines at 77 characters and at newlines. With the ``--no-wrap`` parameter, wrapping is only done at newlines.
sv: Som standard bryter gettext rader vid 77 tecken och vid radbrytningar. Med parametern ``--no-wrap`` bryts rader endast vid radbrytningar.

source: Only wrap lines at newlines (like ``xgettext --no-wrap``)
sv: Vik endast rader vid radbrytningar (som ``xgettext --no-wrap``)

source: xml_closing_tags
sv: xml_slut-taggar

source: Android string resources
sv: Android-strängresurser

source: Android specific file format for translating applications.
sv: Android-specifikt filformat fÃ¶r Ã¶versÃ¤ttning av applikationer.

source: A very similar formats are :doc:`/formats/compose-multiplatform-resources` and :doc:`/formats/moko-resources`.
sv: Mycket liknande format Ã¤r :doc:`/formats/compose-multiplatform-resources` och :doc:`/formats/moko-resources`.

source: Android string resources are monolingual, the :ref:`component-template` is stored in a different location from the other files -- :file:`res/values/strings.xml`.
sv: Android-strÃ¤ngresurser Ã¤r ensprÃ¥kiga, :ref:`component-template` lagras pÃ¥ en annan plats Ã¤n de andra filerna -- :file:`res/values/strings.xml`.

source: Weblate does following escaping of strings:
sv: Weblate utfÃ¶r fÃ¶ljande escape-konvertering av strÃ¤ngar:

source: If a strings is valid XML, it is inserted as XML to translation.
sv: Om en strÃ¤ng Ã¤r giltig XML infogas den som XML i Ã¶versÃ¤ttningen.

source: ``?`` and ``@`` are escaped with a ``\\`` at the beginning of the string to avoid interpreting them as style or resource references.
sv: ``?`` och ``@`` undviks med ett ``\\`` i bÃ¶rjan av strÃ¤ngen fÃ¶r att undvika att de tolkas som stil- eller resursreferenser.

source: In case string contains multiple spaces, it is quoted with double quotes (``"``).
sv: Om strÃ¤ngen innehÃ¥ller flera mellanslag, omges den av dubbla citationstecken (``"``).

source: Newlines are escaped as ``\\n``, but the actual newline is kept for readability as well.
sv: Radbrytningar ersÃ¤tts med ``\\n``, men den faktiska radbrytningen behÃ¥lls ocksÃ¥ fÃ¶r lÃ¤sbarhetens skull.

source: Android `string-array` structures are not currently supported. To work around this, you can break your string arrays apart:
sv: Android-strukturer av typen `string-array` stÃ¶ds fÃ¶r nÃ¤rvarande inte. FÃ¶r att komma runt detta kan du dela upp dina strÃ¤ngmatriser:

source: become:
sv: bli:

source: The `string-array` that points to the `string` elements should be stored in a different file, and not be made available for translation.
sv: StrÃ¤ngmatrisen som pekar pÃ¥ strÃ¤ngelementen ska lagras i en annan fil och inte gÃ¶ras tillgÃ¤nglig fÃ¶r Ã¶versÃ¤ttning.

source: This script may help pre-process your existing strings.xml files and translations: https://gist.github.com/paour/11291062
sv: Det hÃ¤r skriptet kan hjÃ¤lpa dig att fÃ¶rbehandla dina befintliga strings.xml-filer och Ã¶versÃ¤ttningar: https://gist.github.com/paour/11291062

source: To avoid translating some strings, these can be marked as non-translatable. This can be especially useful for string references:
sv: FÃ¶r att undvika att vissa strÃ¤ngar Ã¶versÃ¤tts kan dessa markeras som icke Ã¶versÃ¤ttningsbara. Detta kan vara sÃ¤rskilt anvÃ¤ndbart fÃ¶r strÃ¤ngreferenser:

source: `Android string resources documentation <https://developer.android.com/guide/topics/resources/string-resource>`_
sv: `Dokumentation om strÃ¤ngresurser i Android <https://developer.android.com/guide/topics/resources/string-resource>`_

source: Typical Weblate :ref:`component`
sv: Typisk Weblate :ref:`component`

source: `Empty`
sv: `Tom`

source: `Android String Resource`
sv: `Android-strÃ¤ngresurs`

source: Apple iOS strings
sv: Apple iOS-strängar

source: File format typically used for translating Apple :index:`iOS <pair: iOS; translation>` applications, but also standardized by PWG 5100.13 and used on NeXTSTEP/OpenSTEP.
sv: Filformat som vanligtvis anvÃ¤nds fÃ¶r att Ã¶versÃ¤tta Apple :index:`iOS <pair: iOS; translation>`-applikationer, men som ocksÃ¥ standardiserats av PWG 5100.13 och anvÃ¤nds pÃ¥ NeXTSTEP/OpenSTEP.

source: Apple iOS strings are usually used as monolingual.
sv: Apple iOS-strÃ¤ngar anvÃ¤nds vanligtvis som ensprÃ¥kiga.

source: `Apple "strings files" documentation <https://developer.apple.com/library/archive/documentation/MacOSX/Conceptual/BPInternational/MaintaingYourOwnStringsFiles/MaintaingYourOwnStringsFiles.html>`_
sv: `Apple "strings files" dokumentation <https://developer.apple.com/library/archive/documentation/MacOSX/Conceptual/BPInternational/MaintaingYourOwnStringsFiles/MaintaingYourOwnStringsFiles.html>`_

source: `Message Catalog File Format in PWG 5100.13 <https://ftp.pwg.org/pub/pwg/candidates/cs-ippjobprinterext3v10-20120727-5100.13.pdf#page=66>`_
sv: `Meddelandekatalogfilformat i PWG 5100.13 <https://ftp.pwg.org/pub/pwg/candidates/cs-ippjobprinterext3v10-20120727-5100.13.pdf#page=66>`_

source: ``Resources/en.lproj/Localizable.strings`` or ``Resources/Base.lproj/Localizable.strings``
sv: ``Resources/en.lproj/Localizable.strings`` eller ``Resources/Base.lproj/Localizable.strings``

source: Metadata used for publishing apps in various app stores can be translated. Currently the following tools are compatible:
sv: Metadata som anvÃ¤nds fÃ¶r att publicera appar i olika appbutiker kan Ã¶versÃ¤ttas. FÃ¶r nÃ¤rvarande Ã¤r fÃ¶ljande verktyg kompatibla:

source: The metadata consists of several textfiles, which Weblate will present as separate strings to translate.
sv: Metadata bestÃ¥r av flera textfiler, som Weblate presenterar som separata strÃ¤ngar att Ã¶versÃ¤tta.

source: In case you don't want to translate certain strings (for example changelogs), you can hide them using :ref:`component-key_filter` or mark them read-only (see :ref:`custom-checks`). This can be automated by the :ref:`addon-weblate.flags.bulk`.
sv: Om du inte vill Ã¶versÃ¤tta vissa strÃ¤ngar (till exempel Ã¤ndringsloggar) kan du dÃ¶lja dem med :ref:`component-key_filter` eller markera dem som skrivskyddade (se :ref:`custom-checks`). Detta kan automatiseras med :ref:`addon-weblate.flags.bulk`.

source: `App store metadata files`
sv: `Metadatafiler fÃ¶r appbutiker`

source: ARB File
sv: ARB-fil

source: ARB translations are monolingual, so it is recommended to specify a base file with (what is most often the) English strings.
sv: ARB-Ã¶versÃ¤ttningar Ã¤r ensprÃ¥kiga, sÃ¥ det rekommenderas att ange en basfil med (oftast) engelska strÃ¤ngar.

source: `Application Resource Bundle Specification`_
sv: `Specifikation fÃ¶r applikationsresurspaket`_

source: `Internationalization of Flutter apps`_
sv: `Internationalisering av Flutter-appar`_

source: `ARB file`
sv: `ARB-fil`

source: Catkeys file
sv: Catkeys-fil

source: File format used for Haiku operating system translations.
sv: Filformat som anvÃ¤nds fÃ¶r Ã¶versÃ¤ttningar av operativsystemet Haiku.

source: Example file:
sv: Exempelfil:

source: `Catkeys file`
sv: `Catkeys-fil`

source: Compose Multiplatform resources
sv: Skapa resurser för flera plattformar

source: A variant of :doc:`/formats/android`. It differs in escaping.
sv: En variant av :doc:`/formats/android`. Den skiljer sig Ã¥t i escaping.

source: `Compose Multiplatform Resource`
sv: `Skapa resurs fÃ¶r flera plattformar`

source: CSV files
sv: CSV-filer

source: CSV files can contain a simple list of source and translation. Weblate supports the following files:
sv: CSV-filer kan innehÃ¥lla en enkel lista Ã¶ver kÃ¤lltext och Ã¶versÃ¤ttning. Weblate stÃ¶der fÃ¶ljande filer:

source: Files with header defining fields (``location``, ``source``, ``target``, ``ID``, ``fuzzy``, ``context``, ``translator_comments``, ``developer_comments``). This is the recommended approach, as it is the least error prone. Choose :guilabel:`CSV file` as a file format.
sv: Filer med rubriker som definierar fÃ¤lt (``location``, ``source``, ``target``, ``ID``, ``fuzzy``, ``context``, ``translator_comments``, ``developer_comments``). Detta Ã¤r den rekommenderade metoden, eftersom den Ã¤r minst felbenÃ¤gen. VÃ¤lj :guilabel:`CSV-fil` som filformat.

source: Files with two fieldsâsource and translation (in this order). Choose :guilabel:`Simple CSV file` as a file format.
sv: Filer med tvÃ¥ fÃ¤lt â kÃ¤lla och Ã¶versÃ¤ttning (i denna ordning). VÃ¤lj :guilabel:`Enkel CSV-fil` som filformat.

source: Headerless files with fields in order defined by the `translate-toolkit`_: ``location``, ``source``, ``target``, ``ID``, ``fuzzy``, ``context``, ``translator_comments``, ``developer_comments``. Choose :guilabel:`CSV file` as a file format.
sv: Filer utan rubrik med fÃ¤lt i ordning som definieras av `translate-toolkit`_: ``location``, ``source``, ``target``, ``ID``, ``fuzzy``, ``context``, ``translator_comments``, ``developer_comments``. VÃ¤lj :guilabel:`CSV-fil` som filformat.

source: Remember to define :ref:`component-template` when your files are monolingual (see :ref:`bimono`).
sv: Kom ihÃ¥g att definiera :ref:`component-template` nÃ¤r dina filer Ã¤r ensprÃ¥kiga (se :ref:`bimono`).

source: The CSV format currently automatically detects the dialect of the CSV file. In some cases the automatic detection might fail and you will get mixed results. This is especially true for CSV files with newlines in the values. As a workaround it is recommended to omit quoting characters.
sv: CSV-formatet kÃ¤nner fÃ¶r nÃ¤rvarande automatiskt av dialekten i CSV-filen. I vissa fall kan den automatiska avkÃ¤nningen misslyckas och du fÃ¥r blandade resultat. Detta gÃ¤ller sÃ¤rskilt fÃ¶r CSV-filer med radbrytningar i vÃ¤rdena. Som en lÃ¶sning rekommenderas att man utelÃ¤mnar citattecken.

source: This variant of the CSV files allows storing multiple translations per string.
sv: Denna variant av CSV-filerna gÃ¶r det mÃ¶jligt att lagra flera Ã¶versÃ¤ttningar per strÃ¤ng.

source: Example files
sv: Exempel-filer

source: Typical Weblate :ref:`component` for bilingual CSV
sv: Typisk Weblate :ref:`component` fÃ¶r tvÃ¥sprÃ¥kig CSV

source: `CSV file`
sv: `CSV-fil`

source: Typical Weblate :ref:`component` for monolingual CSV
sv: Typisk Weblate :ref:`component` fÃ¶r ensprÃ¥kig CSV

source: `Simple CSV file`
sv: Enkel CSV-fil

source: DTD files
sv: DTD-filer

source: Example DTD file:
sv: Exempel pÃ¥ DTD-fil:

source: `DTD file`
sv: `DTD-fil`

source: Excel Open XML (.xlsx) files can be imported and exported.
sv: Excel Open XML-filer (.xlsx) kan importeras och exporteras.
